# DefaultDivideSettings Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefaultDivideSettings Class
Members See Also
---
Provides access to project-wide divide settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class DefaultDivideSettings : Element
```

Visual Basic
---
```text
Public Class DefaultDivideSettings _
	Inherits Element
```

Visual C++
---
```text
public ref class DefaultDivideSettings : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..DefaultDivideSettings
# See Also
DefaultDivideSettings Members
Autodesk.Revit.DB Namespace